@php
    $layout = theme_option('product_list_layout');

    $requestLayout = request()->input('layout');
    if ($requestLayout && in_array($requestLayout, array_keys(get_product_single_layouts()))) {
        $layout = $requestLayout;
    }

    $layout = ($layout && in_array($layout, array_keys(get_product_single_layouts()))) ? $layout : 'product-full-width';
    Theme::layout($layout);

    //Theme::asset()->usePath()->add('jquery-ui-css', 'css/plugins/jquery-ui.css');
    //Theme::asset()->container('footer')->usePath()->add('jquery-ui-js', 'js/plugins/jquery-ui.js');
    //Theme::asset()->container('footer')->usePath()->add('jquery-ui-touch-punch-js', 'js/plugins/jquery.ui.touch-punch.min.js');

    $products->loadMissing(['categories', 'categories.slugable']);


    $sorts = EcommerceHelper::getSortParams();
    $shows = EcommerceHelper::getShowParams();
    $sortBy = request()->input('sort-by', 'default_sorting');
    $showing = (int)request()->input('num', (int)theme_option('number_of_products_per_page', 12));
@endphp

{{-- <div class="col-lg-12">
    <a class="shop-filter-toogle" href="#">
        <span class="fal fa-filter mr-5 ml-0"></span>
        <span class="title">{{ __('Filters') }}</span>
        <i class="far fa-angle-up angle-down"></i>
        <i class="far fa-angle-down angle-up"></i>
    </a>
    <form action="{{ URL::current() }}" method="GET" id="products-filter-ajax">
        @if ($layout != 'product-full-width')
            <input type="hidden" name="layout" value="{{ $layout }}">
        @endif
        @include(Theme::getThemeNamespace() . '::views.ecommerce.includes.filters')
    </form>
</div>

<div class="products-listing position-relative">
    @include(Theme::getThemeNamespace() . '::views.ecommerce.includes.product-items', compact('products'))
</div> --}}

<section class="shop-top">
    <div class="container">
        <div class="top">
            @foreach ($crumbs = Theme::breadcrumb()->getCrumbs() as $i => $crumb)
                @if ($i != (count($crumbs) - 1))
                @else
                    <h1>{!! BaseHelper::clean($crumb['label']) !!}</h1>
                @endif
            @endforeach


            @if (Theme::get('hasBreadcrumb', true))
                {!! Theme::partial('breadcrumb') !!}
            @endif
        </div>

        <div class="catalog">
            @include(Theme::getThemeNamespace() . '::views.ecommerce.includes.filters')


            <div class="goods-wrapper">
                <div class="sorting">
                    <div class="choosed-atts">
                        <a class="attr" href="#">Ціна: 1000 - 10000 ₴
                            <svg width="11" height="11" viewBox="0 0 11 11"
                                fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M10.0523 10.4568L5.77819 6.17595L1.50409 10.4568L0.549805 9.50249L4.83063 5.22838L0.549805 0.954281L1.50409 0L5.77819 4.28082L10.0523 0.00672044L10.9999 0.954281L6.72575 5.22838L10.9999 9.50249L10.0523 10.4568Z"
                                    fill="#333333" />
                            </svg>
                        </a>
                        <a class="attr" href="#">Чорний <svg width="11" height="11" viewBox="0 0 11 11"
                                fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M10.0523 10.4568L5.77819 6.17595L1.50409 10.4568L0.549805 9.50249L4.83063 5.22838L0.549805 0.954281L1.50409 0L5.77819 4.28082L10.0523 0.00672044L10.9999 0.954281L6.72575 5.22838L10.9999 9.50249L10.0523 10.4568Z"
                                    fill="#333333" />
                            </svg>
                        </a>
                        <a class="attr" href="#">Коричневий <svg width="11" height="11" viewBox="0 0 11 11"
                                fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M10.0523 10.4568L5.77819 6.17595L1.50409 10.4568L0.549805 9.50249L4.83063 5.22838L0.549805 0.954281L1.50409 0L5.77819 4.28082L10.0523 0.00672044L10.9999 0.954281L6.72575 5.22838L10.9999 9.50249L10.0523 10.4568Z"
                                    fill="#333333" />
                            </svg>
                        </a>
                        <a class="attr" href="#">Синій <svg width="11" height="11" viewBox="0 0 11 11"
                                fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M10.0523 10.4568L5.77819 6.17595L1.50409 10.4568L0.549805 9.50249L4.83063 5.22838L0.549805 0.954281L1.50409 0L5.77819 4.28082L10.0523 0.00672044L10.9999 0.954281L6.72575 5.22838L10.9999 9.50249L10.0523 10.4568Z"
                                    fill="#333333" />
                            </svg>
                        </a>
                    </div>
                    <div class="sort">
                        <div class="filter-btn">
                            <svg width="16" height="16" viewBox="0 0 16 16" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M0.5 2.82561H8.11266C8.34209 3.86894 9.27472 4.65221 10.387 4.65221C11.4992 4.65221 12.4318 3.86897 12.6613 2.82561H15.5C15.7761 2.82561 16 2.60195 16 2.32609C16 2.05023 15.7761 1.82657 15.5 1.82657H12.661C12.4312 0.783772 11.4972 0 10.387 0C9.27609 0 8.34262 0.783647 8.11284 1.82657H0.5C0.223875 1.82657 0 2.05023 0 2.32609C0 2.60195 0.223875 2.82561 0.5 2.82561ZM9.05866 2.3274C9.05866 2.32562 9.05869 2.32381 9.05869 2.32203C9.06087 1.59252 9.65672 0.999063 10.387 0.999063C11.1162 0.999063 11.7121 1.59171 11.7152 2.32088L11.7153 2.32821C11.7142 3.05897 11.1187 3.65321 10.387 3.65321C9.65553 3.65321 9.06028 3.05957 9.05863 2.32924L9.05866 2.3274ZM15.5 13.1744H12.661C12.4311 12.1316 11.4972 11.3478 10.387 11.3478C9.27609 11.3478 8.34262 12.1315 8.11284 13.1744H0.5C0.223875 13.1744 0 13.398 0 13.6739C0 13.9498 0.223875 14.1734 0.5 14.1734H8.11266C8.34209 15.2167 9.27472 16 10.387 16C11.4992 16 12.4318 15.2167 12.6613 14.1734H15.5C15.7761 14.1734 16 13.9498 16 13.6739C16 13.398 15.7761 13.1744 15.5 13.1744ZM10.387 15.001C9.65553 15.001 9.06028 14.4073 9.05863 13.677L9.05866 13.6752C9.05866 13.6734 9.05869 13.6716 9.05869 13.6698C9.06087 12.9403 9.65672 12.3468 10.387 12.3468C11.1162 12.3468 11.7121 12.9395 11.7152 13.6686L11.7153 13.6759C11.7143 14.4068 11.1188 15.001 10.387 15.001ZM15.5 7.50048H7.88734C7.65791 6.45715 6.72528 5.67391 5.61303 5.67391C4.50078 5.67391 3.56816 6.45715 3.33872 7.50048H0.5C0.223875 7.50048 0 7.72414 0 8C0 8.27589 0.223875 8.49952 0.5 8.49952H3.33897C3.56888 9.54229 4.50275 10.3261 5.61303 10.3261C6.72391 10.3261 7.65738 9.54241 7.88716 8.49952H15.5C15.7761 8.49952 16 8.27589 16 8C16 7.72414 15.7761 7.50048 15.5 7.50048ZM6.94134 7.99869C6.94134 8.0005 6.94131 8.00228 6.94131 8.00406C6.93912 8.73357 6.34328 9.32703 5.61303 9.32703C4.88381 9.32703 4.28794 8.73438 4.28478 8.00525L4.28469 7.99794C4.28578 7.26709 4.88125 6.67294 5.61303 6.67294C6.34447 6.67294 6.93972 7.26655 6.94137 7.99691L6.94134 7.99869Z"
                                    fill="black" />
                            </svg>
                            Фільтр
                        </div>
                        <!-- <a href="#" class="sort-btn">По рейтингу</a> -->
                        <!-- класс в селекте выступает модификатором, 
                        в css нужно стилизовать класс .select_sort__select -->
                        <select name="" class="sort__select sort-by-dropdown products_ajaxsortby" data-name="sort-by">
                            @foreach ($sorts as $key => $label)
                                <option data-label="{{ $label }}"
                                class="@if ($sortBy == $key) active @endif"
                                value="{{ request()->fullUrlWithQuery(['sort-by' => $key]) }}">{{ $label }}</option>
                            @endforeach
                        </select>

                        <div class="sort__select_mob">По рейтингу</div>
                    </div>
                </div>

                <div class="goods">
                    @include(Theme::getThemeNamespace() . '::views.ecommerce.includes.product-items', compact('products'))
                    {{-- <a href="#" class="loadmore good">
                        <svg width="151" height="127" viewBox="0 0 151 127" fill="none"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M6.22445 79.455C7.96161 79.455 9.68141 78.6791 10.8164 77.1967L13.3352 73.9251C17.1049 96.2882 32.7683 115.42 55.0041 123.139C61.8485 125.513 68.8725 126.654 75.8037 126.654C96.5571 126.654 116.529 116.416 128.486 98.3901C130.252 95.7265 129.523 92.1306 126.859 90.3644C124.184 88.5867 120.605 89.3279 118.828 91.9916C105.805 111.645 81.1195 119.96 58.8085 112.201C40.2961 105.773 27.3831 89.658 24.6268 70.9429L29.5835 74.7589C32.1256 76.6987 35.7563 76.2355 37.7019 73.6992C39.6533 71.163 39.1843 67.5323 36.648 65.5809C36.648 65.5809 22.9534 55.0363 22.9186 55.0131C20.0407 52.7953 15.9468 51.5504 13.341 54.9494L1.64412 70.138C-0.307299 72.6743 0.161737 76.305 2.698 78.2564C3.74609 79.0613 4.99106 79.455 6.22445 79.455Z"
                                fill="#00963D" />
                            <path
                                d="M24.5812 36.2925C27.2391 38.0586 30.835 37.329 32.6127 34.6653C45.6357 15.018 70.344 6.70276 92.6318 14.4563C111.144 20.8838 124.057 36.9989 126.813 55.714L121.857 51.898C119.315 49.9524 115.684 50.4157 113.738 52.9577C111.787 55.494 112.256 59.1246 114.792 61.0761C114.792 61.0761 128.487 71.6149 128.522 71.6438C131.452 73.8964 135.453 75.1587 138.099 71.7075L149.796 56.5189C151.748 53.9826 151.279 50.352 148.742 48.4005C146.206 46.4491 142.57 46.9239 140.624 49.4602L138.105 52.7319C134.335 30.3688 118.672 11.2368 96.4362 3.51795C69.1048 -5.96697 38.9013 4.20703 22.9541 28.261C21.188 30.9304 21.9176 34.5206 24.5812 36.2925Z"
                                fill="#00963D" />
                        </svg>
                        <div>Показати ще
                            7 товарів</div>
                    </a> --}}
                </div>
            </div>
        </div>
    </div>
</section>


<div class="mobile-sort">
    <!-- <a href="#" class="close">×</a> -->
    <div class="title">
        <svg width="18" height="17" viewBox="0 0 18 17" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M17.7394 10.8629C17.5862 10.7097 17.3784 10.6237 17.1617 10.6237C16.945 10.6237 16.7372 10.7097 16.5839 10.8629L13.8929 13.5539V0.817191C13.8929 0.600459 13.8068 0.392603 13.6536 0.23935C13.5003 0.0860966 13.2925 0 13.0757 0C12.859 0 12.6511 0.0860966 12.4979 0.23935C12.3446 0.392603 12.2585 0.600459 12.2585 0.817191V13.5539L9.56752 10.8629C9.4134 10.7141 9.20697 10.6317 8.99271 10.6336C8.77844 10.6354 8.57348 10.7214 8.42197 10.8729C8.27045 11.0244 8.18451 11.2294 8.18265 11.4436C8.18079 11.6579 8.26315 11.8643 8.41201 12.0184L12.498 16.1044C12.5739 16.1805 12.6641 16.2409 12.7633 16.2821C12.8626 16.3233 12.969 16.3445 13.0765 16.3445C13.184 16.3445 13.2905 16.3233 13.3897 16.2821C13.489 16.2409 13.5792 16.1805 13.6551 16.1044L17.7411 12.0184C17.894 11.865 17.9798 11.657 17.9795 11.4403C17.9792 11.2236 17.8928 11.016 17.7394 10.8629Z" fill="#333333"/>
            <path d="M9.56813 4.32538L5.48217 0.239426C5.40607 0.163167 5.31549 0.102877 5.21577 0.062096C5.01586 -0.0205359 4.79134 -0.0205359 4.59143 0.062096C4.49171 0.102877 4.40114 0.163167 4.32503 0.239426L0.239074 4.32538C0.0858445 4.47883 -0.000153049 4.68686 2.04479e-07 4.90371C0.000153458 5.12057 0.086445 5.32848 0.239892 5.48171C0.393338 5.63494 0.601371 5.72094 0.818224 5.72078C1.03508 5.72063 1.24299 5.63434 1.39622 5.48089L4.08723 2.78988V15.5266C4.08723 15.7434 4.17332 15.9512 4.32658 16.1045C4.47983 16.2577 4.68769 16.3438 4.90442 16.3438C5.12115 16.3438 5.32901 16.2577 5.48226 16.1045C5.63551 15.9512 5.72161 15.7434 5.72161 15.5266V2.78988L8.41262 5.48089C8.56674 5.62975 8.77317 5.71212 8.98743 5.71026C9.2017 5.70839 9.40666 5.62245 9.55817 5.47094C9.70969 5.31942 9.79563 5.11446 9.79749 4.9002C9.79936 4.68593 9.71699 4.47951 9.56813 4.32538Z" fill="#333333"/>
        </svg>
        Сортування
    </div>


    <ul class="sort-items">
        <li class="active"><a href="#">По рейтингу</a></li>
        <li><a href="#">По популярності</a></li>
        <li><a href="#">Спочатку дешевші</a></li>
        <li><a href="#">Спочатку дорожчі</a></li>
        <li><a href="#">По новизні</a></li>
    </ul>
</div>